using System;

namespace CleverLily
{
    internal class Program
    {
        static void Main(string[] args)
        {
            //.1 Създаваме нужните ни променливи, които се въвеждат от потребителя.
            int n = int.Parse(Console.ReadLine()); //. възрастта.
            double priceForWasher = double.Parse(Console.ReadLine()); //. нужната цена за закупване на пералнята.
            int priceForDolls = int.Parse(Console.ReadLine()); //. цена на 1 от играчките.

            //.2 Декларираме нужните ни за целта променливи с начална стойност 0.
            double savedmoney = 0; //. променлива в която държим стойността на събраните до момента пари.
            int dolls = 0; //. променлива в която дъжрим стойността на събраните играчки според това на колко години е.

            //.3 Създаваме цикъл, който да се върти колкото рожденни дни е имал потребителя (n), като започваме от 1.
            for (int i = 1; i <= n; i++)
            {
                //. Проверяваме дали рожденият ден, на който сме в момента (i) е четен.
                if (i % 2 == 0)
                {
                    //. Ако рожденият ден (i) е четен потребителят е получил пари за него 
                    int moneyPerYear = (i / 2) * 10;
                    savedmoney += moneyPerYear - 1;
                }
                //. Ако рожденият ден е нечетен потребителя е получил като подарът играчка.
                else
                {
                    dolls++;
                }

            }
            //.4 Изчисляваме колко пари е събрал потребителя до момента
            double moneyFromDolls = dolls * priceForDolls; //. Променлива в която държим стойността на събраните пари от играчките.
            double totalsum = savedmoney + moneyFromDolls; //. Променлива която държим стойността на цялата събрана сума до момента.

            //5. Проверяваме дали общата събрана сума до момента (totalsum) е по-голяма или равна на цената на пералнята(priceforwasher).
            if (totalsum >= priceForWasher)
            {
                double moneyleft = totalsum - priceForWasher;//. Променлива в която държим рестото при евентуално закупуване на пералнята.
                Console.WriteLine($"Yes! {moneyleft:f2}");//. Отпечатваме на конзолата рестото форматирано до 2-рия знак след запетаята.
            }
            //. В случай че потребителят не е събрал достатъчно пари за пералнята
            else
            {
                double diff = Math.Abs(totalsum - priceForWasher); //. Променлива в която държим абсолютната стойност на разликата нужна ни за закупуването на пералнята
                Console.WriteLine($"No! {diff:f2}"); //. Отпечатваме парите, който не са достигнали на потребителя да закупи пералнята, форматиран до втория знак след запетаята.
            }
        }
    }
}